/*
Little MUS Player v0.2 (about 99% right in DOOM and DOOM II)

Copyright 2025 Andrew Towers

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the “Software”), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in
all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND,
EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

With thanks to:
* The DOSBox Team, OPL2/OPL3 emulation library
* Ken Silverman, ADLIBEMU.C
* https://github.com/rofl0r/woody-opl
* https://doomwiki.org/wiki/MUS
* https://moddingwiki.shikadi.net/wiki/MUS_Format
* https://moddingwiki.shikadi.net/wiki/OP2_Bank_Format
* https://cosmodoc.org/topics/adlib-functions/ !
* https://www.doomworld.com/idgames/docs/editing/mus_form
* https://www.phys.unsw.edu.au/jw/notes.html
* id software, for giving us DOOM.
*/

#include <stdint.h>
#include <string.h>

#include <stdio.h>

// This must be implemented by the program using musplayer.
void adlib_write(int reg, int val);

typedef uint8_t byte;

// TO DO:
// ctrl_bank_select
// ctrl_modulation
// ctrl_pan - stereo mix?
// ctrl_expression
// ctrl_reverb
// ctrl_chorus
// ctrl_sustain
// ctrl_soft

typedef struct __attribute__((packed)) MUS_headerS {
    char       ID[4];          // "MUS", 0x1A
    int16_t    scoreLen;       // in bytes
    int16_t    scoreStart;     // offset to start of score
    int16_t    pri_channels;   // number of primary channels used (0-8; excludes percussion #9)
    int16_t    sec_channels;   // number of secondary channels used (10-14; excludes percussion #15) [rarely used]
    int16_t    instrCnt;       // number of instruments
    int16_t    reserved;       // always 0
    int16_t    instruments[1]; // array of instruments (0-127 standard, 135-181 percussion: notes 35-81 on #15)
} MUS_header;

typedef struct __attribute__((packed)) MUS_voiceS {
    byte       modChar;        // 0x20 Modulator characteristic (Mult, KSR, EG, VIB and AM flags)
    byte       modAttack;      // 0x60 Modulator attack/decay level
    byte       modSustain;     // 0x80 Modulator sustain/release level
    byte       modWaveSel;     // 0xE0 Modulator wave select
    byte       modScale;       // 0x40 Modulator key scaling (first two bits)
    byte       modLevel;       // 0x40 Modulator output level (last six bits)
    byte       feedback;       // 0xC0 Feedback/connection (low 4 bits)
    byte       carChar;        // 0x23 Carrier characteristic (Mult, KSR, EG, VIB and AM flags)
    byte       carAttack;      // 0x63 Carrier attack/decay level
    byte       carSustain;     // 0x83 Carrier sustain/release level
    byte       carWaveSel;     // 0xE3 Carrier wave select
    byte       carScale;       // 0x43 Carrier key scaling (first two bits)
    byte       carLevel;       // 0x43 Carrier output level (last six bits)
    byte       reserved;       // Unused
    int16_t    noteOfs;        // MIDI note offset (ignored when "fixed note" flag is set)
} MUS_voice;

typedef struct __attribute__((packed)) MUS_instrumentS {
    int16_t    flags;          // 0x01 - fixed note, 0x02 - delayed vibrato (unused), 0x04 - Double-voice mode
    byte       fineTune;       // Second voice detune level, 128 center, (fine_tune / 2) - 64
    byte       noteNum;        // Percussion note number, or the note to play when fixed note (between 0 and 127)
    MUS_voice  voice[2];       // Instrument voices, 2nd is for double-voice
} MUS_instrument;

enum mus_flags {
    musf_fixed_note = 1,
    musf_delayed_vibrato = 2,
    musf_double_voice = 4,
};

// MUS body contains only one track.
// Channels numbered from 0, not from 1 (standard midi); percussion on channel #15.
// MUS notes are dynamically mapped to an available OPL channel to allow polyphony.

enum event_type {
    event_release = 0,
    event_note = 1,
    event_pitch_wheel = 2,
    event_system = 3,
    event_controller = 4,
    event_end_of_measure = 5,
    event_end_of_score = 6,
    event_unused = 7,
};

enum controller_enum {
